IDEA StatiCa Open Model
SetupValueInt Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value int
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueInt
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SetupValueInt : SetupValue
Public Class SetupValueInt
	Inherits SetupValue
public ref class SetupValueInt : public SetupValue
The SetupValueInt type exposes the following members.
Constructors
Name | Description
SetupValueInt
Initializes a new instance of the SetupValueInt class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
 (Inherited from SetupValue.)
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace